Revit 2027 API
EnergyDataSettings.GetBuildingConstructionSetElementId Method
 Id of the building construction set.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId GetBuildingConstructionSetElementId(
	Document ccda
)
Public Shared Function GetBuildingConstructionSetElementId (
	ccda As Document
) As ElementId
public:
static ElementId^ GetBuildingConstructionSetElementId(
	Document^ ccda
)
static member GetBuildingConstructionSetElementId :
        ccda : Document -> ElementId
Parameters
ccda Document
Return Value
ElementId
 Returns the id of the building construction set.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The building construction set is the default project construction set used when spaces are not assigned a construction.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace